     A          R YBPROGR
     A            IDLIBRO        5A
     A            AUTORE        10A
     A            TITOLO        15A
     A            ANNO           4A
     A            ISBN          13A
     A            DISP           2A  
